import React from "react";
import { Policy, Header, Container } from "@styles/myPage/PersonalPolicy";
import { useNavigate } from "react-router-dom";
import { BackArrow } from "@styles/svgIcon";

const PersonalPolicy = () => {
  const navigate = useNavigate();
  return (
    <Policy>
      <Header>
        <div className="h3div">
          <BackArrow onClick={() => navigate(-1)} />
          <h3>개인정보 처리방침</h3>
        </div>
      </Header>

      <Container>
        모야 개인 정보 처리/취급 방침
        <br />
        모야 서비스(이하 ‘서비스’라 함)는 이용자(이하 ‘회원‘이라 함)의 동의를
        기반으로 개인정보를 수집하여 서비스를 제공하고 있으며, 주식회사
        시스메틱(이하 ‘회사’라 함)은 정보통신망 이용촉진 및 정보보호 등에 관한
        법률, 개인정보보호법 법령을 준수하고 있습니다.
        <br />
        <br />
        개인정보보호 의무 회사는 "정보통신망법" 등 관계 법령이 정하는 바에 따라
        회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에
        대해서는 관련법 및 회사의 개인정보취급방침이 적용됩니다. 다만, 회사의
        공식 서비스 이외의 링크된 서비스에서는 회사의 개인정보취급방침이
        적용되지 않습니다.
        <br />
        <br />
        1. 수집하는 개인정보 항목
        <br />
        회원가입 시 회사가 ‘회원’의 식별과 ‘서비스’ 이용을 위해 개인정보를
        수집합니다.
        <br />
        <br />
        필수정보 : 로그인ID, 비밀번호, 닉네임. 로그인 ID는 E-mail주소, facebook
        ID, Google+ ID 중 ‘회원’ 가입 시 ‘회원’이 선택했던 ID입니다.
        <br />
        유료 서비스 이용 과정에서 아래와 같은 결제 정보가 수집될 수 있습니다
        <br />
        인앱결제 시: 영수증 번호
        <br />
        ‘서비스’ 이용 시 ‘회원’의 로그인 플랫폼, 서비스 이용기록, 이용약관 동의
        날짜, 단말정보 등이 자동으로 생성되어 수집됩니다. 다양한 이벤트 및
        프로모션 진행 시 상품 지급을 위해 상품 발송을 위한 개인정보를
        수집합니다.
        <br />
        이름, E-mail, 주소, 연락처 등<br />
        <br />
        2. 개인정보 수집방법
        <br />
        개인정보는 회원가입 및 서비스 이용과정에서 회원이 개인정보 수집에 대해
        동의를 하고 직접 입력한 경우 해당 개인정보를 수집합니다.
        <br />
        민원사무처리 과정에서 PC웹, 모바일웹/앱, 메일, 전화 등을 통해 회원
        정보가 수집될 수 있습니다.
        <br />
        기기정보와 같은 생성정보는 PC웹, 모바일웹/앱 이용 과정에서 자동으로
        생성되어 수집될 수 있습니다.
        <br />
        서비스 이용과정에서 IP주소, 쿠키, 방문일시, 서비스이용기록, 기기정보등이
        생성되어 수집될 수 있습니다.
        <br />
        수집한 개인정보는 개인정보의 수집 및 이용목적에만 적용되며 해당
        수집방법을 원치 않을 경우 계정삭제를 통해 개인정보의 수집 및 이용 동의를
        철회할 수 있습니다.
        <br />
        <br />
        3. 개인정보의 수집 및 이용목적
        <br />
        회원가입 및 관리 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인
        식별/인증, 회원자격 유지/관리, 제한적 본인확인제 시행에 따른 본인확인,
        서비스 부정이용 방지, 각종 고지/통지 등을 목적으로 개인정보를
        처리합니다.
        <br />
        민원사무처리 이용문의/버그신고/기능제안/기타문의 등 민원인의 신원확인,
        민원사항 확인, 사실조사를 위한 연락/통지/처리결과 통보 등을 목적으로
        개인정보를 처리합니다.
        <br />
        재화 또는 서비스제공 서비스 제공, 콘텐츠제공, 맞춤서비스 제공, 연령/성별
        인증 등을 목적으로 개인정보를 처리합니다.
        <br />
        서비스 개발 및 마케팅활용 신규서비스 개발 및 맞춤 서비스 제공, 이벤트 및
        광고성 정보 제공 및 참여기회 제공, 인구 통계학적 특성에 따른 서비스 제공
        및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스
        이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
        <br />
        <br />
        4. 개인정보 보유기간 및 이용기간
        <br />
        회원 탈퇴 또는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를
        지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한
        기간동안 보존합니다.
        <br />
        상거래 관련 보존 개인정보 보존항목 : 상거래 이력 보존기간 및 근거 계약
        또는 청약철회 등에 관한 기록 : 전자상거래 등에서의 소비자보호에 관한
        법률보존 기간 5년 대금결제 및 재화 등의 공급에 관한 기록 : 전자상거래
        등에서의 소비자보호에 관한 법률보존 기간 5년 소비자의 불만 또는
        분쟁처리에 관한 기록 : 전자상거래 등에서의 소비자보호에 관한 법률보존
        기간 3년 방문에 관한 기록 : 통신비밀보호법보존 기간 3개월
        <br />
        <br />
        5. 개인정보 파기절차 및 방법
        <br />
        파기 절차
        <br />
        회원이 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져 내부 방침 및 기타
        관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기 됩니다. 이때 DB로
        옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지
        않습니다.
        <br />
        파기 권한
        <br />
        회원의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간이
        종료된 즉시, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료
        등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한
        것으로 인정되는 날로부터 즉시 그 개인정보를 파기합니다.
        <br />
        파기 방법
        <br />
        전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을
        사용합니다.
        <br />
        <br />
        6. 개인정보 자동수집 장치의 설치 운영 및 그 거부에 관한 사항
        <br />
        회사는 서비스 제공을 위해 회원들의 개인정보,서비스 이용정보, 로그기록,
        단말정보 등을 서버에 저장하며 해당 정보를 기반으로 사용자에게 서비스를
        제공합니다. 또한 서비스 이용정보 등은 모바일기기에 저장되기도 합니다.
        <br />
        <br />
        자동수집 및 운영
        <br />
        회사는 회원에게 개인화 서비스 제공을 위해 개인정보, 서비스 이용정보,
        로그기록을 수집하며, 알림 서비스 제공을 위해 단말정보를 함께 수집하여
        최적화된 개인화 서비스를 제공합니다.
        <br />
        <br />
        자동수집 거부
        <br />
        회사는 맞춤화 서비스 제공을 위해 부분적으로 쿠키(cookie)를 이용합니다.
        쿠키란 서버가 사용자를 식별하는 작은 파일로, 문자열을 포함합니다. 회원은
        웹 브라우저 설정을 통해 쿠키를 일부, 또는 모두 거부할 수 있습니다. 다만
        저장 거부 시 개인화 서비스 이용에 어려움이 있을 수 있습니다.
        <br />
        <br />
        7. 개인정보의 기술적/관리적 보호대책
        <br />
        회사는 회원들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출,
        변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적
        대책을 강구하고 있습니다.
        <br />
        <br />
        개인정보 암호화
        <br />
        사용자 비밀번호는 암호화되어 저장 및 관리되고 있으며, 변경 시에도
        비밀번호를 알고 있는 본인만 가능합니다.
        <br />
        <br />
        개인정보 취급 직원의 최소화 및 교육
        <br />
        개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여
        개인정보를 관리하는 대책을 시행하고 있습니다.
        <br />
        <br />
        해킹 등에 대비한 기술적 대책 개인정보 유출 및 훼손을 막기 위하여
        보안프로그램을 설치하고 주기적인 갱신/점검을 하여 개인정보나 자료가
        누출되거나 손상되지 않도록 방지하고 있으며, 기술적/물리적으로 감시 및
        차단하고 있습니다.
        <br />
        <br />
        8. 회원 및 법정대리인의 권리와 행사방법
        <br />
        회원은 자신의 개인정보를 조회하거나 수정 가능하며, 계정삭제를 통해
        개인정보의 수집 및 이용 동의를 철회할 수 있습니다.
        <br />
        만 14세 미만의 아동의 경우, 법정 대리인이 아동의 개인정보를 조회하거나
        수정할 수 있으며, 계정삭제를 통해 서비스이용 철회할 권리를 가집니다.
        <br />
        회원이 개인정보의 오류에 대한 정정을 요청한 경우에는 정정을 완료하기
        전까지 해당 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된
        개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체
        없이 통지하여 정정이 이루어지도록 하겠습니다.
        <br />
        회원 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 개인정보
        보유 및 이용기간에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는
        이용할 수 없도록 처리하고 있습니다.
        <br />
        <br />
        9. 개인정보 보호책임자
        <br />
        회사는 개인정보처리에 관한 업무를 총괄해서 책임지고, 개인정보처리와
        관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보
        보호책임자를 지정하고 있습니다.
        <br />
        개인정보 보호책임자
        <br />
        성명 : 박혜정
        <br />
        직급 : 대표
        <br />
        연락처 : 02-6338-1880
        <br />
        이메일 : ceo@sysmetic.co.kr
        <br />
        회사의 서비스를 이용하시면서 발생한 모든 개인정보 보호관련 문의,
        불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로
        문의하실 수 있습니다. 회사는 정보주체의 문의에 대해 지체 없이 답변 및
        처리해드릴 것입니다.
        <br />
        <br />
        기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에
        문의하시기 바랍니다.
        <br />
        <br />
        개인분쟁조정위원회 (www.1336.or.kr / 1336)
        <br />
        정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4)
        <br />
        대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr / 02-3480-3600)
        <br />
        경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)
        <br />
        <br />
        10. 개인정보 처리방침 변경
        <br />
        본 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른
        변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일전부터
        공지사항을 통하여 고지할 것입니다.
        <br />
        <br />
        11. 기타
        <br />
        모야에 링크되어 있는 사이트들이 개인정보를 수집하는 행위에 대해서는
        ‘모야 개인정보 취급방침’이 적용되지 않음을 알려드립니다.
        <br />
        <br />
        12. 부칙
        <br />
        이 개인정보 처리방침은 2019년 10월 14일부터 적용됩니다.
        <br />
        개인정보 처리방침 버전번호: 2.1
        <br />
        공고일자 : 2019년 10월 14일
        <br />
        시행일자 : 2019년 10월 14일
      </Container>
    </Policy>
  );
};

export default PersonalPolicy;
